FemDesign.Results.ShellDisplacement
FemDesign "Shells, displacements" result

FemDesign.Results.ShellDisplacement.Id
Shell name identifier

FemDesign.Results.ShellDisplacement.ElementId
Finite element id

FemDesign.Results.ShellDisplacement.NodeId
Finite element node id

FemDesign.Results.ShellDisplacement.Ex
Displacement in global x

FemDesign.Results.ShellDisplacement.Ey
Displacement in global y

FemDesign.Results.ShellDisplacement.Ez
Displacement in global z

FemDesign.Results.ShellDisplacement.Fix
Rotation around global x

FemDesign.Results.ShellDisplacement.Fiy
Rotation around global y

FemDesign.Results.ShellDisplacement.Fiz
Rotation around global z

FemDesign.Results.ShellDisplacement.CaseIdentifier
Load case or combination name

FemDesign.Results.ShellDisplacement.DeconstructShellDisplacement(System.Collections.Generic.List{FemDesign.Results.ShellDisplacement},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.